hiperiondev/esp32idf_APRS/main/include/aprs_service.h
/**
 * @brief Whether this station is currently able to transmit on RF at all.
 *
 * True only when the audio ADC/DAC AFSK modem hardware has been brought up
 * this boot (see aprs_service_modem_ready()) and the "Enable audio ADC/DAC
 * modem" setting (g_config.audio_modem_en) is on. This is the single source
 * of truth for raw hardware/config transmit capability, used by the LOOP TEST
 * availability check. It says nothing about whether the IGate is actually
 * configured to relay APRS-IS traffic back to RF for a given station - see
 * aprs_service_can_gate_to_rf() for that.
 *
 * @return true if this station can currently transmit, false otherwise.
 */
bool aprs_service_can_transmit(void);

/**
 * @brief Whether this IGate can currently gate messages from APRS-IS to RF.
 *
 * True only when the station can transmit at all (see
 * aprs_service_can_transmit()), the IGate service is enabled
 * (g_config.igate_en) and the APRS-IS -> RF gateway direction is enabled
 * (g_config.inet2rf). This is the criterion QCON actually asks for when
 * choosing between the qAR and qAO q constructs on a frame gated from RF:
 * qAR marks an IGate that can gate messages to RF for the station being
 * gated, qAO marks one that cannot - which is a stronger condition than
 * merely having a working transmitter, since a station with a working
 * transmitter but INET->RF relaying turned off can never actually deliver a
 * message to RF.
 *
 * @return true if this IGate can currently gate messages to RF, false
 *         otherwise.
 */
bool aprs_service_can_gate_to_rf(void);

/**
 * @brief Audio ADC/DAC AFSK modem self-test ("LOOP TEST" button on the
 * Radio/Modem webconfig page). Requires the ADC and DAC GPIOs (MODEM_ADC_GPIO
 * and MODEM_DAC_GPIO, set in the top-level CMakeLists.txt) to be wired
 * together as a physical audio loopback so whatever the modem transmits is
 * immediately re-received on the same board.
 *
 * Builds a small APRS packet with a random one-time token, temporarily
 * diverts decoded frames to its own hook (so the test frame is never treated
 * as real RF traffic / digipeated / uplinked to APRS-IS), switches the modem
 * to full duplex (a wire loop never gives CSMA a clear channel), transmits it
 * via the DAC, and waits for the ADC/demodulator/decoder chain to hand the
 * same frame back. The real hook and the configured duplex mode are always
 * restored before returning.
 *
 * @param msg      Buffer that receives a human-readable PASS/FAIL result.
 * @param msg_len  Size of msg.
 * @return true if the packet was sent and correctly decoded back, false
 *         otherwise (msg explains why: not initialized, timeout, mismatch,
 *         or a test already running).
 */
bool aprs_loop_test_run(char *msg, size_t msg_len);

/**
 * @brief Receive level and bias measurement ("RX LEVEL" button on the
 * Radio/Modem webconfig page).
 *
 * Watches the modem's receive front-end for about a second and renders the
 * result as a JSON object. Nothing is transmitted and no modem state is
 * touched, so it can be run with a transceiver connected and while real
 * traffic is being decoded - which is what the loop test cannot do, since
 * that one keys up and waits to hear itself back.
 *
 * The measurement is what the audio interface is adjusted against: the RMS
 * level sets the receive attenuator, the raw conversion extremes show how
 * much headroom is left before the converter runs out of range, and the DC
 * offset shows where the input is biased - the reading that tells an
 * AC-coupled input with the ADC self-bias enabled from one with no bias at
 * all.
 *
 * The reported object carries @c ok, @c mVrms, @c peak_mVrms, @c dc_mV,
 * @c agc, @c raw_min, @c raw_max, @c dcd and @c adc_samples, followed by the
 * receive statistics of modem_get_rx_stats(): @c demods (active
 * demodulators), @c decoded and @c unique (arrays of @c demods entries, one
 * per demodulator), @c delivered, @c repaired, @c fifo_drops and @c pool_ovf.
 * Every value is produced locally, so nothing received off the air is ever
 * echoed into it.
 *
 * @param json     Buffer that receives the JSON object.
 * @param json_len Size of json.
 * @return true if the measurement completed, false if the modem is not
 *         running or the loop test holds the diagnostics (json still carries
 *         an object explaining which).
 */
bool aprs_rx_level_sample(char *json, size_t json_len);

/**
 * @brief Bounded transmit burst ("TX TEST" button on the Radio/Modem
 * webconfig page).
 *
 * Keys the transmitter and modulates a short APRS status packet, then
 * unkeys - without waiting to hear anything back. It is the transmit-side
 * counterpart of aprs_rx_level_sample(): what the transmit attenuator is set
 * against when a transceiver, rather than a wire loop, is connected, since
 * the deviation it produces is measured on other equipment.
 *
 * The normal half-duplex channel access applies, so the burst waits for a
 * clear channel like any other frame, and the long-term duty-cycle ceiling is
 * honored when it is enabled.
 *
 * @param msg     Buffer that receives a human-readable result.
 * @param msg_len Size of msg.
 * @return true if the burst was transmitted, false otherwise (msg explains
 *         why: modem not running, duty cycle exhausted, or a diagnostic
 *         already in progress).
 */
bool aprs_tx_test_run(char *msg, size_t msg_len);

#endif // APRS_SERVICE_H
